---
kind: other
id: Methods.T:Autodesk.Revit.UI.ColorSelectionDialog
source: html/29e6adc5-8d91-948d-3c50-54146686b7a3.htm
---
# ColorSelectionDialog Methods

Shows the Revit Color dialog as a modal dialog.